Repository: SmartDeviceLink-Examples/example_weather_app_ios
Catalog: MobileWeather/*.lproj/Localizable.strings
Languages: de, fr

# app.tts-name
source: mobile weather
de: mobail weather
fr: mobail weddair

# app.vr-synonym
source: mobile weather
de: mobail weather
fr: mobail weddair

# units.metric
source: metric
de: Metrisch
fr: métrique

# units.temp.degree.full
source: degree(s)
de: Grad
fr: degré(s)

# units.temp.fahrenheit.full
source: degree(s) Fahrenheit
de: Grad Fahrenheit
fr: degré(s) Fahrenheit

# units.temp.celsius.full
source: degree(s) Celsius
de: Grad Celsius
fr: degré(s) Celsius

# units.percent.default.full
source: percent
de: Prozent
fr: pourcent

# units.length.meter.full
source: meter(s)
de: Meter
fr: mètre(s)

# units.length.millimeter.full
source: millimeter(s)
de: Millimeter
fr: millimètre(s)

# units.length.kilometer.full
source: kilometer(s)
de: Kilometer
fr: kilomètre(s)

# units.length.mile.full
source: mile(s)
de: Meile(n)

# units.length.inch.full
source: inch(es)
de: Zoll
fr: pouce(s)

# units.speed.meter-second.full
source: meter(s) per second
de: Meter pro Sekunde
fr: mètre(s) par seconde

# units.speed.kilometer-hour.full
source: kilometer(s) per hour
de: Kilometer pro Stunde
fr: kilomètre(s) par heure

# units.speed.mile-hour.full
source: mile(s) per hour
de: Meile(n) pro Stunde
fr: mile(s) par heure

# show.welcome.field1
source: Welcome to
de: Willkommen bei
fr: Bienvenue chez

# speak.welcome
source: welcome to mobile weather
de: Willkommen bei mobail weather.
fr: Bienvenue chez mobail weddair

# alert.no-conditions.field1
source: Conditions
de: Wetterdaten

# alert.no-conditions.field2
source: Not Available
de: nicht verfügbar
fr: Indisponible

# alert.no-conditions.prompt
source: current conditions not available
de: Aktuelle Wetterdaten nicht verfügbar.
fr: Conditions actuelles indisponibles

# alert.no-forecast.field1
source: Forecast
de: Vorhersagen
fr: Prévision

# alert.no-forecast.field2
source: Not Available
de: nicht verfügbar
fr: Indisponible

# alert.no-forecast.prompt
source: forecast not available
de: Wettervorhersage nicht Verfügbar.
fr: Prévisions indisponibles

# alert.no-alerts.field1
source: No
de: Keine
fr: Non

# alert.no-alerts.field2
source: Alerts
de: Warnungen
fr: Alertes

# alert.no-alerts.prompt
source: no alerts at this time
de: Zur Zeit liegen keine Wetterwarnungen vor.
fr: A cet instant il n'y a pas d'alertes disponibles

# conditions.speak
source: it is currently %1$@, and %2$@ with %3$@ humidity, and a wind speed of %4$@
de: es ist aktuell %1$@, und %2$@ bei %3$@ luftfeuchtigkeit, bei einer windgeschwindigkeit von %4$@
fr: actuellement il est %1$@, et %2$@, avec %3$@ humidité, et une vitesse de vent %4$@

# conditions.title.short
source: ^((possible )?((light|heavy|dangerously|partly|mostly|mixed) )?\b[^\s]+\b)
de: ^(((schwer|stark|leicht|wechselnd|¸berwiegend|frisch)(e|er)? )?\b[^\s]+\b)
fr: ^((((très )?faible)|forte)(s?) )?(dégagé|précipitations|bruine|brumeux|nuages épars|nuageux|couvert|pluie|vent(é?)|averses de neige|neige( (fondue|faible))?)( (épar|faible|fort(e?)|mêlée)(s?))?( possible(s?))?

# cmd.current-conditions
source: Current conditions
de: Aktuelles Wetter
fr: Conditions actuelles

# cmd.daily-forecast
source: Daily forecast
de: Tägliche Vorhersage
fr: Prévisions quotidiennes

# cmd.hourly-forecast
source: Hourly forecast
de: Stündliche Vorhersage
fr: Prévisions horaires

# cmd.alerts
source: Alerts
de: Warnungen
fr: Alertes

# cmd.change-units
source: Change units
de: Einheiten ändern
fr: Changement des unités

# cmd.next
source: Next
de: Nächstes
fr: Suivant

# cmd.previous
source: Previous
de: Voriges
fr: Précédent

# cmd.show-list
source: Show list
de: Liste anzeigen
fr: Afficher la liste

# cmd.show-message
source: Show message
de: Meldung anzeigen
fr: Afficher messages

# cmd.back
source: Back
de: Zurück
fr: Retour

# vr.current
source: current
de: aktuell
fr: a ce moment

# vr.conditions
source: conditions
de: wetter

# vr.current-conditions
source: current conditions
de: aktuelles wetter
fr: conditions actuelles

# vr.show-conditions
source: show conditions
de: zeige wetter
fr: afficher les conditions

# vr.show-current-conditions
source: show current conditions
de: zeige aktuelles wetter
fr: afficher les conditions actuelles

# vr.daily
source: daily
de: täglich
fr: quotidienne

# vr.daily-forecast
source: daily forecast
de: tägliche wettervorhersage
fr: prévision quotidienne

# vr.show-daily-forecast
source: show daily forecast
de: zeige tägliche wettervorhersage
fr: afficher les prévisions quotidiennes

# vr.hourly
source: hourly
de: stündlich
fr: horaire

# vr.hourly-forecast
source: hourly forecast
de: stündliche wettervorhersage
fr: prévision horaire

# vr.show-hourly-forecast
source: show hourly forecast
de: zeige stündliche wettervorhersage
fr: afficher les prévisions horaires

# vr.units
source: units
de: einheiten
fr: unités

# vr.change-units
source: change units
de: einheiten ändern
fr: changer les unités

# vr.metric
source: metric
de: metrisch
fr: métrique

# vr.next
source: next
de: nächstes
fr: suivant

# vr.previous
source: previous
de: voriges
fr: précédent

# vr.back
source: back
de: zurück
fr: retour

# vr.list
source: list
de: liste
fr: liste

# vr.show-list
source: show list
de: zeige liste
fr: afficher la liste

# vr.now
source: now
de: jetzt
fr: maintenant

# vr.today
source: today
de: heute
fr: aujourd'hui

# vr.tomorrow
source: tomorrow
de: morgen
fr: demain

# vr.alerts
source: alerts
de: warnungen
fr: alertes

# vr.show-alerts
source: show alerts
de: zeige warnungen
fr: afficher les alertes

# vr.message
source: message
de: meldung

# vr.show-message
source: show message
de: zeige meldung
fr: afficher les messages

# sb.current
source: Current
de: Aktuell
fr: Actuelle

# sb.daily
source: Daily
de: Täglich
fr: Quotid.

# sb.hourly
source: Hourly
de: Stündl.
fr: Horaire

# sb.alerts
source: Alerts
de: Warn.

# sb.list
source: List
de: Liste
fr: Liste

# sb.message
source: Message
de: Meld.

# sb.back
source: Back
de: Zurück
fr: Retour

# weather-alerts.format.date-time.show
source: MM/d h a
de: dd.MM HH
fr: dd.MM HH'h'mm

# weather-alerts.format.date-time.speak
source: d'. of' MMMM, h a
de: d'ten' MMMM H 'uhr'
fr: d'e 'MMMM', 'H' horloge'

# weather-alerts.speak
source: %1$@ until %2$@
de: %1$@ bis zum %2$@
fr: %1$@ à %2$@

# choice.units.metric
source: Metric
de: Metrisch
fr: Métrique

# pi.units.text
source: Change units
de: Einheiten ändern
fr: Changement des unités

# pi.units.initial-prompt
source: please select units in metric or imperial
de: bitte wählen sie die einheiten in metrisch oder imperial
fr: Selectionnez les unités en métrique ou impérial s.v.p.

# pi.units.help-prompt
source: metric, imperial
de: metrisch, imperial
fr: métrique, impérial

# pi.units.timeout-prompt
source: metric, imperial
de: metrisch, imperial
fr: métrique, impérial

# pi.daily-forecast.text
source: Select day
de: Tag wählen
fr: Selectionnez le jour

# pi.daily-forecast.initial-prompt
source: please select a day of the forecast
de: bitte wählen sie einen tag der wettervorhersage
fr: Selectionnez le jour des prévisions s.v.p.

# pi.daily-forecast.help-prompt
source: a day of week, like monday, tuesday, or today, tomorrow
de: einen wochentag, wie montag, dienstag, oder heute, morgen
fr: un jour de la semaine, comme lundi, mardi soit aujourd'hui, demain

# pi.daily-forecast.timeout-prompt
source: a day of week, today, tomorrow
de: einen wochentag, heute, morgen
fr: un jour de la semaine, aujourd'hui, demain

# pi.hourly-forecast.text
source: Select hour
de: Stunde wählen
fr: Selectionnez l'heure

# pi.hourly-forecast.initial-prompt
source: please select an hour of the forecast
de: bitte wählen sie eine stunde der wettervorhersage
fr: selectionnez l'heure des prévisions

# pi.hourly-forecast.help-prompt
source: an hour, like 11 am, or now
de: eine stunde, wie 11 uhr, oder jetzt
fr: une heure, comme onze heure, soit maintenant

# pi.hourly-forecast.timeout-prompt
source: an hour, now
de: eine stunde, jetzt
fr: une heure, maintenant

# forecast.daily.format.date-time.show
source: MM/d
de: dd.MM
fr: dd.MM

# forecast.daily.format.date-time.speak
source: MMMM d
de: d'ter' MMMM
fr: d'e 'MMMM

# forecast.daily.speak
source: %1$@ it will be %2$@, from %3$.0f to %4$.0f %5$@ with %6$@ humidity, and %7$@ precipitation chance
de: %1$@ wird es %2$@, von %3$.0f bis %4$.0f %5$@ bei %6$@ Luftfeuchtigkeit, und %7$@ Regenwahrscheinlichkeit.
fr: %1$@ %2$@, de %3$.0f à %4$.0f %5$@, avec %6$@ humidité, et %7$@ de chance sur précipitation

# forecast.hourly.choice.show
source: MM/d h a
de: dd.MM HH 'Uhr'
fr: dd.MM HH'h'00

# forecast.hourly.choice.speak
source: h a
de: H 'Uhr'
fr: H' horloge'

# forecast.hourly.format.date-time.show
source: h a
de: HH:00
fr: HH'h'00

# forecast.hourly.format.date-time.speak
source: h a
de: H 'Uhr'
fr: H' horloge'

# forecast.hourly.speak
source: at %1$@ it will be %2$@, and %3$@ with %4$@ humidity, and %5$@ precipitation chance
de: Um %1$@ wird es %2$@, und %3$@ bei %4$@ Luftfeuchtigkeit, und %5$@ Regenwahrscheinlichkeit.
fr: à %1$@ %2$@, et %3$@, avec %4$@ humidité, et %5$@ de chance sur précipitation

# units.imperial
source: imperial
fr: impérial

# vr.imperial
source: imperial
fr: impérial

# choice.units.imperial
source: Imperial
fr: Impérial
